#!/usr/bin/env python
# -*- coding:utf-8 -*-
# @Time    : 2018/10/21 21:13
# @Author  : Administrator
# @Site    : 
# @File    : Python练习实例3.py
# @Software: PyCharm

"""
题目：
    一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？
-----------------------------------------------------
思路：
    1.x + 100 = n的平方 
    2.x + 100 +168 = m的平方
    3.m的平方 - n的平方 = (m-n)(m+n) = 168
    4.m + n = i,m - n = j，i * j =168，i 和 j 至少一个是偶数
    5.m = (i + j) / 2， n = (i - j) / 2，i 和 j 要么都是偶数，要么都是奇数
    6.所以i和j都是偶数
    7.由于 i * j = 168， j>=2，则 1 < i < 168 / 2 + 1 = 85
-----------------------------------------------------
""" 

for i in range(2,85):
    if 168 % i == 0:
        j = 168 / i

        if (i + j) % 2 == 0 and (i - j) % 2 == 0 and i > j:
            m = (i + j) / 2
            n = (i - j) / 2
            print n * n - 100
            

