#!/usr/bin/env python
# -*- coding:utf-8 -*-
# @Time    : 2018/10/21 21:13
# @Author  : Administrator
# @Site    : 
# @File    : Python练习实例20.py
# @Software: PyCharm

"""
题目：
    一球从100米高度自由落下，每次落地后反跳回原高度的一半；再落下，求它在第10次落地时，共经过多少米？第10次反弹多高？
-----------------------------------------------------
思路：
    等比数列 Sn=a1(1-qn)/(1-q)（q≠1) a(n+1)=a1qn
-----------------------------------------------------
""" 
a0 = 100.0
a1 = 100.0
q = 0.5
n = 10
Sn = a0 + a1 * (1 - q ** (n-1)) / (1 - q)
an = a1 * q ** n
print("第10次落地时，共经过%f米,反弹%f高"  % (Sn,an))

