#!/usr/bin/env python
# -*- coding:utf-8 -*-
# @Time    : 2018/10/21 21:13
# @Author  : Administrator
# @Site    :
# @File    : Python练习实例44.py
# @Software: PyCharm

"""
题目：
    两个 3 行 3 列的矩阵，实现其对应位置的数据相加，并返回一个新矩阵：
    X = [[12,7,3],
        [4 ,5,6],
        [7 ,8,9]]

    Y = [[5,8,1],
        [6,7,3],
        [4,5,9]]
-----------------------------------------------------
思路：

-----------------------------------------------------
"""

if __name__ == "__main__":
    X = [[12, 7, 3],
         [4, 5, 6],
         [7, 8, 9]]
    Y = [[5, 8, 1],
         [6, 7, 3],
         [4, 5, 9]]

    result = [[0, 0, 0],
              [0, 0, 0],
              [0, 0, 0]]
    # result = [[0, 0, 0]] * 3 使用列表乘以3是浅拷贝
    for i in range(3):
        for j in range(3):
            result[i][j] = X[i][j] + Y[i][j]
            print result

    print result
